{
  "backend/main.mo": "Motoko canister defining a 30‑day program, user profiles, and progress APIs with authorization checks and map‑based storage.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of many frontend file paths to short human‑written summaries for reference.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark themes with global CSS variable definitions.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "App router setup defining all main routes and wrapping content in ThemeProvider and AppShell.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query‑cache clearing and loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter a name and save their profile.",
  "frontend/src/components/exercise/ExerciseMedia.tsx": "Component that displays exercise video or image with error handling and fallback UI.",
  "frontend/src/components/layout/AppShell.tsx": "React layout component providing navigation, mobile drawer, user greeting, and identity‑aware UI structure.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Implements a countdown timer hook with start, pause, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity persistence logic.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for program data, progress, days, and user profiles.",
  "frontend/src/hooks/useWorkoutActions.ts": "Mutation hooks for marking days complete, resetting progress, and saving user profiles with query invalidation.",
  "frontend/src/index.css": "Tailwind base styles and fitness‑themed design tokens for light/dark mode with gradient utilities.",
  "frontend/src/lib/programContent.ts": "Defines workout program structure and media mapping for daily exercises with detailed program data.",
  "frontend/src/lib/progressMath.ts": "Utility functions to compute next incomplete day, streak length, and completion percentage.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers before rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user fitness dashboard with authentication checks, progress data, and a sign‑in prompt for unauthenticated users.",
  "frontend/src/pages/DayDetailsPage.tsx": "Shows detailed workout info for a specific day, including exercises, completion state, and navigation back to the program.",
  "frontend/src/pages/OnboardingPage.tsx": "Presents an introductory overview of the 30‑day program and instructions on how to use the app.",
  "frontend/src/pages/ProgramPage.tsx": "Renders the full 30‑day schedule grouped by weeks, showing completion status and enabling navigation to each day.",
  "frontend/src/pages/WorkoutRunnerPage.tsx": "Provides an interactive workout runner with exercise progress tracking, timers, and completion handling for a given day.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params (including hash routing), persisting them in sessionStorage, and clearing them from the URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings using multiple plugins.",
  "project_state.json": "Describes the project’s current state, features, issues, and architectural notes for a 30‑day fitness app."
}